In [11]:
import pandas as pd

In [12]:
path = "https://github.com/KyungChic/DATA-ANALASIS/blob/main/Project2.%20%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%B6%84%EC%84%9D%20%EC%8B%A4%EB%AC%B4%20%ED%8C%8C%EC%9D%B4%EC%8D%AC/FILES/2_Data_Analysis_Basic/files/sample_1.xlsx?raw=true"
sample_1 = pd.read_excel(path, 
                         header = 1,    #칼럼명이 위치한 행의 index를 지정. 
                         skipfooter = 2,    #최하단 2행을 제외하고 read 함
                         usecols = "A:C")       #A부터 C칼럼을 읽어옴.

In [13]:
sample_1

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [14]:
sample_1.tail(3)

  국적코드  성별    입국객수
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [15]:
sample_1.head(3)

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319

In [16]:
sample_1.info()


# class : pandas 내의 DataFrame 클래스임을 나타냄
## Data columns : 총 column 수
### 국적코드 / 성별 / 입국객수 : 각 칼럼의 name과 null 값, 그리고 형식을 나타냄
#### dtypes : 형식의 구성을 나타냄
##### memory usage : 차지하는 메모리의 양

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
국적코드    6 non-null object
성별      6 non-null object
입국객수    6 non-null int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [17]:
sample_1.describe()

# count : 데이터의 개수
## mean : 평균값
### std : 표준편차
#### min : 최솟값
##### 25%, 50%, 75% : 1사분위수, 2사분위수, 3사분위수
###### max : 최댓값

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

In [18]:
sample_1['입국객수'] #하나의 칼럼 슬라이싱

0    106320
1    191436
2       319
3        42
4    158912
5    232943
Name: 입국객수, dtype: int64

In [26]:
sample_1[['성별', '입국객수']] #다수의 칼럼 슬라이싱

   성별    입국객수
0  남성  106320
1  여성  191436
2  남성     319
3  여성      42
4  남성  158912
5  여성  232943

In [27]:
sample_1['기준년월'] = '2019-11' #칼럼 생성

In [29]:
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [41]:
condition = (sample_1['성별'] == '남성')   #필터링하기 

print(condition)  ##condition의 타입은 series : 1차원 형태의 데이터(1줄 형태의 DF)

0     True
1    False
2     True
3    False
4     True
5    False
Name: 성별, dtype: bool

In [43]:
sample_1[condition]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11

In [53]:
sample_1[[True, True, True, True, True, True, True]]

ValueError: Item wrong length 7 instead of 6.

In [55]:
sample_1[[True, True, True, True, True, True]]  #index로 series를 넣을 때에는 row의 개수와 series의 원소가 일치해야 읽힌다.

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [63]:
condition = (sample_1['성별'] == '남성') & (sample_1['입국객수'] >= 150000)  # 조건이 두개

print(condition)

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [74]:
condition1 = (sample_1['성별'] == '남성') \
            & (sample_1['입국객수'] >= 150000) 
# 두줄로 가독성을 높이려면 '\'(역슬래시) 사용 : 역슬래시는 두줄을 한줄로 인식하게 함. (단 주석도 같이 읽혀짐.)

print(condition1)

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [75]:
condition2 = (sample_1['성별'] == '남성') \ #주석
            & (sample_1['입국객수'] >= 150000) 

condition2

SyntaxError: unexpected character after line continuation character (<ipython-input-75-a3b19ca12617>, line 1)

In [83]:
condition = (sample_1['성별'] == '남성') | (sample_1['입국객수'] >= 150000) #or조건 사용

sample_1[condition]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [91]:
#해당하는 값으로 필터링하기 (국적코드가 A01, A18인 사람들을 필터링)

condition = (sample_1['국적코드'].isin(['A01', 'A18']))

print(sample_1[condition])


## 해당하지 않는 값에 대해 출력하고 싶다면?

print(sample_1[condition == False])

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11
  국적코드  성별  입국객수     기준년월
2  A31  남성   319  2019-11
3  A31  여성    42  2019-11